# Data Cleaning and Preparation

## Handling Missing Data

In [140]:
import pandas as pd
import numpy as np

In [141]:
string_data = pd.Series(['Hello','world',np.nan,'corona'])
string_data

0     Hello
1     world
2       NaN
3    corona
dtype: object

In [142]:
string_data.isna()

0    False
1    False
2     True
3    False
dtype: bool

In [143]:
string_data[0] = None

In [144]:
string_data.isnull()

0     True
1    False
2     True
3    False
dtype: bool

In [145]:
string_data.notnull()

0    False
1     True
2    False
3     True
dtype: bool

### Filtering Out Missing Data

In [146]:
from numpy import nan as NA

In [147]:
data = pd.Series([1,NA,3.5,NA,7])
data

0    1.0
1    NaN
2    3.5
3    NaN
4    7.0
dtype: float64

#### dropna()

**dropna returns non null value and their index.**

In [148]:
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

**This is equavalent to:**

In [149]:
data[ data.notnull() ]

0    1.0
2    3.5
4    7.0
dtype: float64

**With DataFrame objects, things are a bit more complex. You may want to drop rows
or columns that are all NA or only those containing any NAs. dropna by default drops
any row containing a missing value**

In [150]:
data = pd.DataFrame([[1., 6.5, 3.], [1., NA, NA],
 [NA, NA, NA], [NA, 6.5, 3.]])

In [151]:
cleaned = data.dropna()

In [152]:
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [153]:
cleaned

     0    1    2
0  1.0  6.5  3.0

**Passing how='all' will only drop rows that are all NA**

In [154]:
cleaned = data.dropna( how='all')

In [155]:
cleaned

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

**To drop columns in the same way, pass axis=1**

In [156]:
data[4] = NA
data

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [157]:
cleaned = data.dropna(axis=1,how='all')
cleaned

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

**dropna(thresh=2),by default axis=0. will drop rows that contains two NA**

In [158]:
data = pd.DataFrame(np.random.randn(7,3))
data

          0         1         2
0  1.007189 -1.296221  0.274992
1  0.228913  1.352917  0.886429
2 -2.001637 -0.371843  1.669025
3 -0.438570 -0.539741  0.476985
4  3.248944 -1.021228 -0.577087
5  0.124121  0.302614  0.523772
6  0.000940  1.343810 -0.713544

In [159]:
data.iloc[:4,1] = NA
data.iloc[:2,2] = NA
data

          0         1         2
0  1.007189       NaN       NaN
1  0.228913       NaN       NaN
2 -2.001637       NaN  1.669025
3 -0.438570       NaN  0.476985
4  3.248944 -1.021228 -0.577087
5  0.124121  0.302614  0.523772
6  0.000940  1.343810 -0.713544

In [160]:
cleaned = data.dropna(thresh=2)
cleaned

          0         1         2
2 -2.001637       NaN  1.669025
3 -0.438570       NaN  0.476985
4  3.248944 -1.021228 -0.577087
5  0.124121  0.302614  0.523772
6  0.000940  1.343810 -0.713544

### Filling In Missing Data

#### fillna()

**Rather than filtering out missing data, we may want to fill in the “holes” in any number of ways**

In [161]:
data.fillna(0)

          0         1         2
0  1.007189  0.000000  0.000000
1  0.228913  0.000000  0.000000
2 -2.001637  0.000000  1.669025
3 -0.438570  0.000000  0.476985
4  3.248944 -1.021228 -0.577087
5  0.124121  0.302614  0.523772
6  0.000940  1.343810 -0.713544

**Calling fillna with a dict, you can use a different fill value for each column**

In [162]:
data.fillna({1:0.5,2:0.2})

          0         1         2
0  1.007189  0.500000  0.200000
1  0.228913  0.500000  0.200000
2 -2.001637  0.500000  1.669025
3 -0.438570  0.500000  0.476985
4  3.248944 -1.021228 -0.577087
5  0.124121  0.302614  0.523772
6  0.000940  1.343810 -0.713544

**fill na returns an object but we can modify the main object by giving inplace = True**

In [163]:
data.fillna(0,inplace=True)
data

          0         1         2
0  1.007189  0.000000  0.000000
1  0.228913  0.000000  0.000000
2 -2.001637  0.000000  1.669025
3 -0.438570  0.000000  0.476985
4  3.248944 -1.021228 -0.577087
5  0.124121  0.302614  0.523772
6  0.000940  1.343810 -0.713544

**method = 'ffill'. fills all the NA values with the value of above row.**

In [164]:
df = pd.DataFrame(np.random.randn(6, 3))

In [165]:
df.iloc[2:, 1] = NA
df.iloc[4:, 2] = NA
df

          0         1         2
0 -0.831154 -2.370232 -1.860761
1 -0.860757  0.560145 -1.265934
2  0.119827       NaN  0.332883
3 -2.359419       NaN -1.541996
4 -0.970736       NaN       NaN
5  0.377984       NaN       NaN

In [166]:
df.fillna(method='ffill')

          0         1         2
0 -0.831154 -2.370232 -1.860761
1 -0.860757  0.560145 -1.265934
2  0.119827  0.560145  0.332883
3 -2.359419  0.560145 -1.541996
4 -0.970736  0.560145 -1.541996
5  0.377984  0.560145 -1.541996

**max two values will be filled from a column**

In [167]:
df.fillna(method='ffill', limit=2)

          0         1         2
0 -0.831154 -2.370232 -1.860761
1 -0.860757  0.560145 -1.265934
2  0.119827  0.560145  0.332883
3 -2.359419  0.560145 -1.541996
4 -0.970736       NaN -1.541996
5  0.377984       NaN -1.541996

In [168]:
df

          0         1         2
0 -0.831154 -2.370232 -1.860761
1 -0.860757  0.560145 -1.265934
2  0.119827       NaN  0.332883
3 -2.359419       NaN -1.541996
4 -0.970736       NaN       NaN
5  0.377984       NaN       NaN

In [169]:
#values will be filled with the nearest column value.
df.fillna(axis=1,method='ffill')

          0         1         2
0 -0.831154 -2.370232 -1.860761
1 -0.860757  0.560145 -1.265934
2  0.119827  0.119827  0.332883
3 -2.359419 -2.359419 -1.541996
4 -0.970736 -0.970736 -0.970736
5  0.377984  0.377984  0.377984

**With fillna we can do lots of other things with a little creativity**

In [170]:
data = pd.Series([1., NA, 3.5, NA, 7])
data

0    1.0
1    NaN
2    3.5
3    NaN
4    7.0
dtype: float64

In [171]:
data.fillna(data.mean())

0    1.000000
1    3.833333
2    3.500000
3    3.833333
4    7.000000
dtype: float64

## Data Transformation

### Removing Duplicates

In [172]:
data = pd.DataFrame({'k1':['one','two']*3+['two'],'k2':[1,1,2,3,3,4,4]})
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

#### duplicated()

**duplicated() returns boolean series where duplicated rows are maked with true.**

In [173]:
duplicate = data.duplicated()
duplicate

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [174]:
data.loc[duplicate]

    k1  k2
6  two   4

#### drop_duplicates()

**drop_duplicates returns a DataFrame where the duplicated array is
False.**

In [175]:
non_duplicate = data.drop_duplicates()
non_duplicate

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

**dropping duplicates from column**

In [176]:
data['v1'] = range(7)

In [177]:
data.drop_duplicates(['k1'])

    k1  k2  v1
0  one   1   0
1  two   1   1

duplicated and drop_duplicates by default keep the first observed value combination.
Passing keep='last' will return the last one.

In [178]:
data.drop_duplicates(['k1', 'k2'], keep='last')

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
6  two   4   6

### Transforming Data Using a Function or Mapping

In [179]:
data = pd.DataFrame({'food': ['bacon', 'pulled pork', 'bacon',
      'Pastrami', 'corned beef', 'Bacon',
 'pastrami', 'honey ham', 'nova lox'],
'ounces': [4, 3, 12, 6, 7.5, 8, 3, 5, 6]})
data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     Pastrami     6.0
4  corned beef     7.5
5        Bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

Suppose we wanted to add a column indicating the type of animal that each food
came from.

#### str.lower()

In [180]:
meat_to_animal = {
'bacon': 'pig',
'pulled pork': 'pig',
'pastrami': 'cow',
'corned beef': 'cow',
'honey ham': 'pig',
'nova lox': 'salmon'
}

In [181]:
lowercased = data.food.str.lower()
lowercased

0          bacon
1    pulled pork
2          bacon
3       pastrami
4    corned beef
5          bacon
6       pastrami
7      honey ham
8       nova lox
Name: food, dtype: object

In [182]:
data['animal'] = lowercased.map(meat_to_animal)
data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     Pastrami     6.0     cow
4  corned beef     7.5     cow
5        Bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

**We could also have passed a function that does all the work**

In [183]:
#It will return an object of the mapped value
data.food.map(lambda x: meat_to_animal[x.lower()])

0       pig
1       pig
2       pig
3       cow
4       cow
5       pig
6       cow
7       pig
8    salmon
Name: food, dtype: object

### Replacing Values

In [184]:
data = pd.Series([1., -999., 2., -999., -1000., 3.])
data

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

#### replace()

In [185]:
data.replace(-999,np.nan)

0       1.0
1       NaN
2       2.0
3       NaN
4   -1000.0
5       3.0
dtype: float64

**Replace multiple values**

**By default inplace is false so, it will return a dataframe with replaced value**

In [186]:
data.replace([-999,-1000],np.nan)

0    1.0
1    NaN
2    2.0
3    NaN
4    NaN
5    3.0
dtype: float64

**To use a different replacement for each value**

In [187]:
data.replace([-999,-1000],[np.nan,0])

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

**The argument passed can also be a dict**

In [188]:
data.replace( {-999:np.nan,-1000:1} )

0    1.0
1    NaN
2    2.0
3    NaN
4    1.0
5    3.0
dtype: float64

### Renaming Axis Indexes

In [189]:
data = pd.DataFrame(np.arange(12).reshape((3, 4)),
                            index=['Ohio', 'Colorado', 'New York'],
                                        columns=['one', 'two', 'three', 'four'])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

In [190]:
transform = lambda x: x[0:4].upper()

In [191]:
data.index = data.index.map(transform)
data

      one  two  three  four
OHIO    0    1      2     3
COLO    4    5      6     7
NEW     8    9     10    11

#### rename()

In [192]:
data.rename(index={'INDIANA':'indi'},columns={'one':'first'},inplace=True)

In [193]:
data

      first  two  three  four
OHIO      0    1      2     3
COLO      4    5      6     7
NEW       8    9     10    11

### Discretization and Binning

**Suppose we have data about a group of people in a study, and we want to group
them into discrete age buckets.**

In [194]:
ages = [20, 22, 25, 27, 21, 23, 37, 31, 61, 45, 41, 32]

**Let’s divide these into bins of 18 to 25, 26 to 35, 36 to 60, and finally 61 and older. To
do so, we have to use cut, a function in pandas.**

In [195]:
bins = [18, 25, 35, 60, 100]

#### cut

In [196]:
cats = pd.cut(ages,bins)
cats

[(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (25, 35], (60, 100], (35, 60], (35, 60], (25, 35]]
Length: 12
Categories (4, interval[int64]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

#### cats.codes

**internally it contains a categories array specifying the distinct
category names along with a labeling for the ages data in the codes attribute.**

In [197]:
cats.codes

array([0, 0, 0, 1, 0, 0, 2, 1, 3, 2, 2, 1], dtype=int8)

#### cats.categories

In [198]:
cats.categories

IntervalIndex([(18, 25], (25, 35], (35, 60], (60, 100]],
              closed='right',
              dtype='interval[int64]')

In [199]:
cats.value_counts()

(18, 25]     5
(25, 35]     3
(35, 60]     3
(60, 100]    1
dtype: int64

**we can change which
side is closed by passing right=False.**

In [200]:
pd.cut(ages,[18, 26, 36, 61, 100],right=False)

[[18, 26), [18, 26), [18, 26), [26, 36), [18, 26), ..., [26, 36), [61, 100), [36, 61), [36, 61), [26, 36)]
Length: 12
Categories (4, interval[int64]): [[18, 26) < [26, 36) < [36, 61) < [61, 100)]

**we can also pass your own bin names by passing a list or array to the labels option.**

In [201]:
group_names = ['Youth', 'YoungAdult', 'MiddleAged', 'Senior']

In [202]:
pd.cut(ages,bins,labels=group_names)

[Youth, Youth, Youth, YoungAdult, Youth, ..., YoungAdult, Senior, MiddleAged, MiddleAged, YoungAdult]
Length: 12
Categories (4, object): [Youth < YoungAdult < MiddleAged < Senior]

#### qcut

**qcut uses sample quantiles instead, by definition
we will obtain roughly equal-size bins**

In [203]:
data = np.random.randn(1000)

In [204]:
cuts = pd.qcut(data,4)
cuts

[(0.626, 3.928], (-0.022, 0.626], (-0.022, 0.626], (-0.022, 0.626], (0.626, 3.928], ..., (-0.022, 0.626], (-0.684, -0.022], (-2.9499999999999997, -0.684], (-2.9499999999999997, -0.684], (-2.9499999999999997, -0.684]]
Length: 1000
Categories (4, interval[float64]): [(-2.9499999999999997, -0.684] < (-0.684, -0.022] < (-0.022, 0.626] < (0.626, 3.928]]

In [205]:
cuts.value_counts()

(-2.9499999999999997, -0.684]    250
(-0.684, -0.022]                 250
(-0.022, 0.626]                  250
(0.626, 3.928]                   250
dtype: int64

### Detecting and Filtering Outliers

In [206]:
data = pd.DataFrame(np.random.randn(1000, 4))

In [207]:
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean      0.048284     0.024665     0.000140    -0.051869
std       0.996427     1.006642     0.992637     0.998159
min      -3.645860    -3.184377    -3.745356    -3.428254
25%      -0.599807    -0.612162    -0.682799    -0.743886
50%       0.047101    -0.016127    -0.020427    -0.091364
75%       0.750195     0.690847     0.699046     0.623331
max       2.653656     3.525865     2.735527     3.366626

In [208]:
col = data[2]

In [209]:
col[ np.abs(col)>2 ]

5      2.406483
43    -3.399312
57     2.463238
59     2.735527
90     2.389645
105   -2.047939
120   -2.630247
128   -2.253294
137    2.268799
138   -3.745356
146    2.377020
155   -2.043524
173    2.424667
184    2.152572
204    2.094259
226    2.242465
306   -2.224413
320    2.213145
331   -2.691584
335    2.036981
355   -2.815059
356   -2.490860
414    2.194551
422   -2.080934
435   -2.651879
444   -2.065110
458   -2.261761
511   -2.881858
515   -2.140710
539    2.043916
546   -2.186301
617    2.275784
648   -2.049386
756    2.221307
771    2.611678
817    2.044813
877   -2.206448
884   -2.020492
887    2.482286
911   -2.121482
986    2.238196
987   -2.173409
Name: 2, dtype: float64

To select all rows having a value exceeding 3 or –3, you can use the any method on a
boolean DataFrame

In [210]:
data[(np.abs(data)>3).any(1)]

            0         1         2         3
43   0.457246 -0.025907 -3.399312 -0.974657
62   1.951312  3.260383  0.963301  1.201206
138  0.508391 -0.196713 -3.745356 -1.520113
237 -0.242459 -3.056990  1.918403 -0.578828
260  0.682841  0.326045  0.425384 -3.428254
324  1.179227 -3.184377  1.369891 -1.074833
546 -3.548824  1.553205 -2.186301  1.277104
637 -0.578093  0.193299  1.397822  3.366626
784 -0.207434  3.525865  0.283070  0.544635
805 -3.645860  0.255475 -0.549574 -1.907459

### Permutation and Random Sampling

In [211]:
df = pd.DataFrame(np.arange(20).reshape((5,4)) )
df

    0   1   2   3
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15
4  16  17  18  19

#### np.random.permutation

In [212]:
#it permutes all the values from 0 to 5
sampler = np.random.permutation(5)

In [213]:
sampler

array([0, 4, 2, 1, 3])

#### df.take

In [214]:
df.take(sampler)

    0   1   2   3
0   0   1   2   3
4  16  17  18  19
2   8   9  10  11
1   4   5   6   7
3  12  13  14  15

In [215]:
sample = np.random.permutation(4)
sample

array([1, 0, 2, 3])

In [216]:
df.take(sample,axis=1)

    1   0   2   3
0   1   0   2   3
1   5   4   6   7
2   9   8  10  11
3  13  12  14  15
4  17  16  18  19

#### df.sample

**To select a random subset without replacement, we can use the sample method on
Series and DataFrame.**

In [217]:
df.sample(n=3)

    0   1   2   3
2   8   9  10  11
3  12  13  14  15
1   4   5   6   7

In [218]:
df.sample(n=3,axis=1)

    1   3   2
0   1   3   2
1   5   7   6
2   9  11  10
3  13  15  14
4  17  19  18

**To generate a sample with replacement (to allow repeat choices), pass replace=True
to sample.**

In [219]:
se = pd.Series(np.arange(8))
se

0    0
1    1
2    2
3    3
4    4
5    5
6    6
7    7
dtype: int32

There is eight values in total. we need 15 values. so, rest of the values will be created by replacing the same eight values.

In [220]:
sample = se.sample(n=15,replace=True)
sample

4    4
0    0
3    3
4    4
2    2
2    2
5    5
6    6
0    0
6    6
3    3
7    7
4    4
7    7
5    5
dtype: int32

### Computing Indicator/Dummy Variables

**Another type of transformation for statistical modeling or machine learning applica
tions is converting a categorical variable into a “dummy” or “indicator” matrix. If a
column in a DataFrame has k distinct values, you would derive a matrix or Data‐
Frame with k columns containing all 1s and 0s.**

In [221]:
df = pd.DataFrame({'key': ['b', 'b', 'a', 'c', 'a', 'b'],
 'data1': range(6)})
df

  key  data1
0   b      0
1   b      1
2   a      2
3   c      3
4   a      4
5   b      5

#### pd.get_dummies()

In [222]:
pd.get_dummies(df['key'])

   a  b  c
0  0  1  0
1  0  1  0
2  1  0  0
3  0  0  1
4  1  0  0
5  0  1  0

In [223]:
dummies = pd.get_dummies(df['key'],prefix='key')
dummies

   key_a  key_b  key_c
0      0      1      0
1      0      1      0
2      1      0      0
3      0      0      1
4      1      0      0
5      0      1      0

In [224]:
df_with_dummy = df[['data1']].join(dummies)

In [225]:
df_with_dummy

   data1  key_a  key_b  key_c
0      0      0      1      0
1      1      0      1      0
2      2      1      0      0
3      3      0      0      1
4      4      1      0      0
5      5      0      1      0

In [226]:
movies = pd.read_csv('Dataset/movies.csv')

In [227]:
movies.head()

,movieId,title,genres
0,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy
1,2,Jumanji (1995),Adventure|Children|Fantasy
2,3,Grumpier Old Men (1995),Comedy|Romance
3,4,Waiting to Exhale (1995),Comedy|Drama|Romance
4,5,Father of the Bride Part II (1995),Comedy

In [228]:
movies.rename(columns={'movieId':'movie_id'},inplace=True)
movies.columns

Index(['movie_id', 'title', 'genres'], dtype='object')

In [229]:
movies[:10]

,movie_id,title,genres
0,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy
1,2,Jumanji (1995),Adventure|Children|Fantasy
2,3,Grumpier Old Men (1995),Comedy|Romance
3,4,Waiting to Exhale (1995),Comedy|Drama|Romance
4,5,Father of the Bride Part II (1995),Comedy
5,6,Heat (1995),Action|Crime|Thriller
6,7,Sabrina (1995),Comedy|Romance
7,8,Tom and Huck (1995),Adventure|Children
8,9,Sudden Death (1995),Action
9,10,GoldenEye (1995),Action|Adventure|Thriller

In [230]:
all_genres = []

In [231]:
for x in movies.genres:
    all_genres.extend(x.split(sep='|'))
    genre = pd.unique(all_genres)
genre

array(['Adventure', 'Animation', 'Children', 'Comedy', 'Fantasy',
       'Romance', 'Drama', 'Action', 'Crime', 'Thriller', 'Horror',
       'Mystery', 'Sci-Fi', 'War', 'Musical', 'Documentary', 'IMAX',
       'Western', 'Film-Noir', '(no genres listed)'], dtype=object)

**One way to construct the indicator DataFrame is to start with a DataFrame of all
zeros**

In [232]:
zero_matrix = np.zeros((len(movies),len(genre)))

In [233]:
dummies = pd.DataFrame(zero_matrix,columns=genre)
dummies.head()

,Adventure,Animation,Children,Comedy,Fantasy,Romance,Drama,Action,Crime,Thriller,Horror,Mystery,Sci-Fi,War,Musical,Documentary,IMAX,Western,Film-Noir,(no genres listed)
0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
1,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
2,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
4,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0

#### Setiing entries to dummies

**Now, iterate through each movie and set entries in each row of dummies to 1.**

In [234]:
gen = movies.genres[0]

In [235]:
gen.split('|')

['Adventure', 'Animation', 'Children', 'Comedy', 'Fantasy']

In [236]:
dummies.columns.get_indexer(gen.split('|') )

array([0, 1, 2, 3, 4], dtype=int64)

In [237]:
for indx,val in enumerate(movies.genres):
    columns = dummies.columns.get_indexer(val.split('|'))
    dummies.iloc[indx,columns] = 1

In [238]:
dummies.head()

,Adventure,Animation,Children,Comedy,Fantasy,Romance,Drama,Action,Crime,Thriller,Horror,Mystery,Sci-Fi,War,Musical,Documentary,IMAX,Western,Film-Noir,(no genres listed)
0,1.0,1.0,1.0,1.0,1.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
1,1.0,0.0,1.0,0.0,1.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
2,0.0,0.0,0.0,1.0,0.0,1.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3,0.0,0.0,0.0,1.0,0.0,1.0,1.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
4,0.0,0.0,0.0,1.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0

**Then, as before, we can combine this with movies.**

In [239]:
movies_windic = movies.join(dummies.add_prefix('Genre_'))

In [240]:
movies_windic.head()

,movie_id,title,genres,Genre_Adventure,Genre_Animation,Genre_Children,Genre_Comedy,Genre_Fantasy,Genre_Romance,Genre_Drama,...,Genre_Horror,Genre_Mystery,Genre_Sci-Fi,Genre_War,Genre_Musical,Genre_Documentary,Genre_IMAX,Genre_Western,Genre_Film-Noir,Genre_(no genres listed)
0,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy,1.0,1.0,1.0,1.0,1.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
1,2,Jumanji (1995),Adventure|Children|Fantasy,1.0,0.0,1.0,0.0,1.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
2,3,Grumpier Old Men (1995),Comedy|Romance,0.0,0.0,0.0,1.0,0.0,1.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3,4,Waiting to Exhale (1995),Comedy|Drama|Romance,0.0,0.0,0.0,1.0,0.0,1.0,1.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
4,5,Father of the Bride Part II (1995),Comedy,0.0,0.0,0.0,1.0,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0

**For much larger data, this method of constructing indicator variables
with multiple membership is not especially speedy. It would
be better to write a lower-level function that writes directly to a
NumPy array, and then wrap the result in a DataFrame.**

**A useful recipe for statistical applications is to combine get_dummies with a discretization
function like cut.**

In [241]:
#We set the random seed with numpy.random.seed to make the example deterministic.
np.random.seed(12345)

In [242]:
values = np.random.randn(10)
values

array([-0.20470766,  0.47894334, -0.51943872, -0.5557303 ,  1.96578057,
        1.39340583,  0.09290788,  0.28174615,  0.76902257,  1.24643474])

In [243]:
bins = [-3,-1,0,0.2,0.4,0.6,0.8,1,2]

In [244]:
pd.get_dummies(pd.cut(values,bins))

   (-3.0, -1.0]  (-1.0, 0.0]  (0.0, 0.2]  (0.2, 0.4]  (0.4, 0.6]  (0.6, 0.8]  \
0             0            1           0           0           0           0
1             0            0           0           0           1           0
2             0            1           0           0           0           0
3             0            1           0           0           0           0
4             0            0           0           0           0           0
5             0            0           0           0           0           0
6             0            0           1           0           0           0
7             0            0           0           1           0           0
8             0            0           0           0           0           1
9             0            0           0           0           0           0

   (0.8, 1.0]  (1.0, 2.0]
0           0           0
1           0           0
2           0           0
3           0           0
4           0           1
5           0           1
6           0           0
7           0           0
8           0           0
9           0           1

## String Manipulation

### String Object Methods

#### split()

**a comma-separated string can be broken into pieces with
split.**

In [245]:
val = 'a,ab,    hello'

In [246]:
val.split(',')

['a', 'ab', '    hello']

#### strip()

**Split is often combined with strip to remove whitespace(including line breaks). strip removes leading and trailing whitespace.**

In [247]:
pieces = [x.strip() for x in val.split(',')]
pieces

['a', 'ab', 'hello']

These substrings could be concatenated together with a two-colon delimiter using
addition

In [248]:
first,second,third = pieces

In [249]:
first+'::'+second+'::'+third

'a::ab::hello'

#### join()

In [250]:
'::'.join(pieces)

'a::ab::hello'

In [251]:
'hello' in pieces

True

#### index(),find(),count(),replace()

In [252]:
val.index('ab')

2

In [253]:
val.find('ab')

2

In [254]:
val.count('a')

2

In [255]:
val.replace(',','::')

'a::ab::    hello'

#### endswith(),startswith()

In [256]:
val.endswith('o')

True

In [257]:
val.startswith('a')

True

### Regular Expressions

**Python’s built-in
module is
re
responsible for applying regular expressions to strings.The
module functions fall into three categories: pattern matching, substitution,
re
and splitting**

The regex describing one or more whitespace characters
is \s+

#### re.split()

In [258]:
import re

In [259]:
text = "foo  bar\t baz \tqux"

In [260]:
re.split('\s+',text)

['foo', 'bar', 'baz', 'qux']

#### re.compile()

**we can compile the regex yourself with re.compile, forming a reusable regex object.Creating a regex object with re.compile is highly recommended if you intend to
apply the same expression to many strings; doing so will save CPU cycles.**

In [261]:
regex = re.compile('\s+')

In [262]:
regex.split(text)

['foo', 'bar', 'baz', 'qux']

#### re.findall()

If, instead, you wanted to get a list of all patterns matching the regex, you can use the
findall method.

In [263]:
regex.findall(text)

['  ', '\t ', ' \t']

In [264]:
re.findall('\s+',text)

['  ', '\t ', ' \t']

**While findall returns all matches
in a string, search returns only the first match.**

In [265]:
text = """Dave da.ve@google.com
Steve st%e-ve@gmail.com
Rob rob_@gmail.com
Ryan r-ya+n@yahoo.com
"""

In [266]:
#{2,4} means the words length is minimum 2 and maximum 4.
pattern = r'[A-Z0-9._%+-]+@[A-Z0-9.-]+\.[A-Z]{2,4}'

In [267]:
# re.IGNORECASE makes the regex case-insensitive
regex = re.compile(pattern,flags=re.IGNORECASE)
regex.findall(text)

['da.ve@google.com', 'st%e-ve@gmail.com', 'rob_@gmail.com', 'r-ya+n@yahoo.com']

#### re.search()

search returns a special match object for the first email address in the text. For the
preceding regex, the match object can only tell us the start and end position of the
pattern in the string.

In [268]:
m = regex.search(text)

In [269]:
m

In [270]:
text[m.start():m.end()]

'da.ve@google.com'

#### re.match()

regex.match returns None, as it only will match if the pattern occurs at the start of the
string.

In [271]:
print(regex.match(text))

None

#### re.sub()

**Relatedly, sub will return a new string with occurrences of the pattern replaced by the
a new string**

In [272]:
print(regex.sub('Replace',text))

Dave Replace
Steve Replace
Rob Replace
Ryan Replace

#### partitioning email

**Suppose you wanted to find email addresses and simultaneously segment each
address into its three components**

In [273]:
pattern = r'([A-Z0-9._%+-]+)@([A-Z0-9.-]+)\.([A-Z]{2,4})'

In [274]:
regex = re.compile(pattern,flags=re.IGNORECASE)

In [275]:
m = regex.findall(text)
m

[('da.ve', 'google', 'com'),
 ('st%e-ve', 'gmail', 'com'),
 ('rob_', 'gmail', 'com'),
 ('r-ya+n', 'yahoo', 'com')]

In [276]:
m = regex.match('wesm@bright.net')
m.groups()

('wesm', 'bright', 'net')

#### re.sub() in groups

**sub also has access to groups in each match using special symbols like \1 and \2. The
symbol \1 corresponds to the first matched group, \2 corresponds to the second, and
so forth**

In [277]:
print(regex.sub(r'Username: \1,Domain: 2\,Suffix: \3',text) )

Dave Username: da.ve,Domain: 2\,Suffix: com
Steve Username: st%e-ve,Domain: 2\,Suffix: com
Rob Username: rob_,Domain: 2\,Suffix: com
Ryan Username: r-ya+n,Domain: 2\,Suffix: com

### Vectorized String Functions in pandas

Cleaning up a messy dataset for analysis often requires a lot of string munging and
regularization. To complicate matters, a column containing strings will sometimes
have missing data:

In [278]:
data = {'Dave': 'dave@google.com', 'Steve': 'steve@gmail.com',
 'Rob': 'rob@gmail.com', 'Wes': np.nan}

In [280]:
data = pd.Series(data)
data

Dave     dave@google.com
Steve    steve@gmail.com
Rob        rob@gmail.com
Wes                  NaN
dtype: object

**We can search gmail substring by using string function or by using regular expression.**

#### Using series as string

#### data.str.contains()

In [306]:
data.str.contains('gmail')

Dave     False
Steve     True
Rob       True
Wes        NaN
dtype: object

**Regular expressions can be used, too, along with any re options like IGNORECASE.**

In [331]:
pattern = r'([A-Z0-9._%+-]+)@([A-Z0-9.-]+)\.([A-Z]{2,4})'

In [333]:
seperated = data.str.findall(pattern,flags=re.IGNORECASE)
seperated

Dave     [(dave, google, com)]
Steve    [(steve, gmail, com)]
Rob        [(rob, gmail, com)]
Wes                        NaN
dtype: object

In [319]:
match = data.str.match(pattern,flags=re.IGNORECASE)
match

Dave     True
Steve    True
Rob      True
Wes       NaN
dtype: object

In [325]:
match.str.get(1)

Dave    NaN
Steve   NaN
Rob     NaN
Wes     NaN
dtype: float64

#### (slicing) Series.str[0:5]

In [330]:
data.str[0:5]

Dave     dave@
Steve    steve
Rob      rob@g
Wes        NaN
dtype: object

#### data.str.extract() returns dataframe

In [352]:
df = data.str.extract(pattern,flags=re.IGNORECASE)
df

           0       1    2
Dave    dave  google  com
Steve  steve   gmail  com
Rob      rob   gmail  com
Wes      NaN     NaN  NaN

In [359]:
df[df.iloc[:,1].notnull()][1]

Dave     google
Steve     gmail
Rob       gmail
Name: 1, dtype: object